Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: In the case where it equals .south, print "Watch out for penguins".”
ja: それが.southに等しい場合には、"Watch out for penguins"を出力する。」

source: In the case where it equals .north, print "Lots of planets have a north".
ja: それが.northに等しい場合には、"Lots of planets have a north"を出力する。

source: In the code above, stepSize is a global variable, and it is normally accessible from within increment(_:).
ja: 上のコードにおいて、stepSizeはグローバル変数です、そしてそれは通常はincrement(_:)内部からアクセス可能です。

source: In the code above, both of the parameters to takesTwoFunctions(first:second:) are functions.
ja: 上のコードにおいて、takesTwoFunctions(first:second:)へのパラメータは両方とも関数です。

source: In the code above, concatenating badStart with end produces a two-line string, which isn’t the desired result.
ja: 上のコードにおいて、badStartをendと連結することは、２行の文字列を生成します、それは望んだ結果ではありません。

source: In the code above, instead of calling the closure passed to it as its customerProvider argument, the collectCustomerProviders(_:) function appends the closure to the customerProviders array.
ja: 上のコードにおいて、それのcustomerProvider引数としてそれに渡されるクロージャを呼び出す代わりに、collectCustomerProviders(_:)関数は、そのクロージャをcustomerProviders配列に追加します。

source: In the code above, the optional value assumedString is force-unwrapped before assigning its value to implicitString because implicitString has an explicit, non-optional type of String.
ja: 上のコードにおいて、オプショナル値assumedStringは強制アンラップされます、それの値をimplicitStringに割り当てる前にです、なぜならimplicitStringはある明示的な、非オプショナル型のStringを持つからです。

source: In the code below, john has a residence property value of nil:
ja: 下記のコードにおいて、johnはnilのresidenceプロパティ値を持ちます：

source: In the code below, the TwelveOrLess structure ensures that the value it wraps always contains a number less than or equal to 12.
ja: 下のコードにおいて、TwelveOrLess構造体は、それがラップする値が常に12より少ないか等しいある数を含むことを保証します。

source: In the code example below, the dictionary’s keys are decomposed into a constant called animalName, and the dictionary’s values are decomposed into a constant called legCount.
ja: 下のコード例において、辞書のキーはanimalNameと呼ばれる定数へと分解されます、そして辞書の値はlegCountと呼ばれる定数へと分解されます。

source: In the context of Vector2D, it makes sense to consider “equal” as meaning “both instances have the same x values and y values”, and so this is the logic used by the operator implementation.
ja: Vector2Dの文脈では、「同等」を「両方のインスタンスが同じx値とy値を持つ」ことを意味すると考えるのが道理にかなっています、なのでそれが演算子実装によって使われる論理です。

source: In the door access example above, it’s useful to add parentheses around the first part of the compound expression to make its intent explicit:
ja: 上のドア・アクセスの例で、その意図を明確にするために複合式の最初の部分のまわりに丸括弧を加えることは、役に立ちます：

source: In the example above, Ace is explicitly given a raw value of 1, and the rest of the raw values are assigned in order.
ja: 上の例では、Aceは暗黙的に1の生の値を与えられます、そして残りの生の値は順に割り当てられます。

source: In the example above, CompassPoint.south has an implicit raw value of "south", and so on.
ja: 上の例において、CompassPoint.southは暗黙的な生の値の"south"をもちます、等々。

source: In the example above, Planet.mercury has an explicit raw value of 1, Planet.venus has an implicit raw value of 2, and so on.
ja: 上の例において、Planet.mercuryは明示的な生の値の1を持ちます、Planet.venusは暗黙的な生の値の2を持ちます、等々。

source: In the example above, SomeClassOnlyProtocol can only be adopted by class types.
ja: 上の例で、SomeClassOnlyProtocolはクラス型によってのみ採用されることができます。

source: In the example above, greeting is a string, which means it has a region of memory where the characters that make up the string are stored.
ja: 上の例において、greetingは文字列です、それはその文字列を作り上げる文字が格納されるところのメモリ領域をそれが持つことを意味します。

source: In the example above, incrementBySeven and incrementByTen are constants, but the closures these constants refer to are still able to increment the runningTotal variables that they have captured.
ja: 上の例で、incrementBySevenとincrementByTenは定数です、しかしこれらの定数が言及するクロージャはそれでもなお、それらが捕獲したrunningTotal変数を増加させることができます。

source: In the example above, index is a constant whose value is automatically set at the start of each iteration of the loop.
ja: 上の例で、indexは、ループの各繰り返しの開始時点でその値が自動的に設定される定数です。

source: In the example above, let distributes to each identifier pattern in the tuple pattern (x, y).
ja: 上の例で、letは、タプルパターン(x, y)における各識別子パターンに分配されます。

source: In the example above, possiblePlanet is of type Planet?, or “optional Planet.”
ja: 上の例で、possiblePlanetは型Planet?、すなわち「オプショナルのPlanet」です。

source: In the example above, length is initialized when the new range is created and cannot be changed thereafter, because it is a constant property.
ja: 上の例で、lengthは新しい範囲が作成される時に初期化されます、そしてその後は変更されることが出来ません、なぜならそれが変数プロパティだからです。

source: In the example above, Oscar’s health and energy are passed as the two in-out parameters to balance(_:_:).
ja: 上の例において、Oscarの体力とエネルギーは２つのin-outパラメータとしてbalance(_:_:)に渡されます。

source: In the example above, an empty string ("") is a valid, non-optional String.
ja: 上の例において、空の文字列（""）は有効な、オプショナルでないStringです。

source: In the example above, calling balance(_:_:) on the elements of a tuple produces a conflict because there are overlapping write accesses to playerInformation.
ja: 上の例において、balance(_:_:)をタプルの要素上で呼び出すことは衝突を生み出します、なぜならplayerInformationに対するオーパーラップ書き込みアクセスが存在するからです。

source: In the example above, calling the shareHealth(with:) method for Oscar’s player to share health with Maria’s player doesn’t cause a conflict.
ja: 上の例において、shareHealth(with:)メソッドをOscarのプレイヤーに対して呼びだしてMariaのプレイヤーと体力を共有することは、衝突を引き起こしません。

source: In the example above, even though the entire multiline string literal is indented, the first and last lines in the string don’t begin with any whitespace.
ja: 上の例において、たとえ複数行リテラル全体が字下げされるとしても、その文字列の最初と最後の行は全く空白で始まりません。

source: In the example above, it is guaranteed that number % 10 will always be a valid subscript key for the digitNames dictionary, and so an exclamation point is used to force-unwrap the String value stored in the subscript’s optional return value.
ja: 上の例でnumber % 10は常にdigitNames辞書のための有効な添え字キーであることを求められます、なのでその添え字のオプショナルの戻り値に保管したString値を強制アンラップするために感嘆符が使われます。

source: In the example above, it is the choice of closure that incrementByTen refers to that is constant, and not the contents of the closure itself.
ja: 上の例では、それは「クロージャの選択」です、それがincrementByTenが参照するものであり、それは定数であり、そしてクロージャ自身の内容ではありません。

source: In the example above, the Size structure has a default value for both its height and width properties.
ja: 上の例において、Size構造体は省略時の値をそれのheightとwidthプロパティの両方に対して持ちます。

source: In the example above, the Suffix associated type for Stack is also Stack, so the suffix operation on Stack returns another Stack.
ja: 上の例において、StackのためのSuffix関連型もまたStackです、それでStack上のsuffix演算は別のStackを返します。

source: In the example above, the allItemsMatch(_:_:) function correctly reports that all of the items in the two containers match.
ja: 上の例で、allItemsMatch(_:_:)関数は、２つのコンテナの中の項目の全てが一致すると正しく報告します。

source: In the example above, the description property correctly reports that the Ace of Spades has a value of 1 or 11.
ja: 上の例で、descriptionプロパティは、スペードのエースが1または11の値を持つことを正しく報告します。

source: In the example above, the Key type parameter is constrained to conform to the Hashable protocol and therefore String must also conform to the Hashable protocol.
ja: 上の例で、Key型パラメータは、Hashableプロトコルに準拠することを強制されます、したがってStringもまたHashableプロトコルに準拠しなければなりません。

source: In the example above, the compiler infers that myVariable is an integer because its initial value is an integer.
ja: 上の例で、コンパイラはmyVariableが整数であると推測します、その最初の値が整数であるためです。

source: In the example above, the first three decimal codeUnit values (68, 111, 103) represent the characters D, o, and g, whose UTF-8 representation is the same as their ASCII representation.
ja: 上の例において、最初の３つの10進のcodeUnit値（68、111、103）は、文字D、o、そしてgを表わします、これらのUTF-８叙述はそれらのASCII叙述と同じものです。

source: In the example above, the operator is used to determine an initial value for a String variable called colorNameToUse.
ja: 上の例で、この演算子はcolorNameToUseと呼ばれるあるString変数の初期値を確定するために使われます。

source: In the example above, the use of an implicitly unwrapped optional means that all of the two-phase class initializer requirements are satisfied.
ja: 上の例で、暗黙的にアンラップされるオプショナルの使用は、２段階のクラスイニシャライザの必要とする条件の全てが満たされることを意味します。

source: In the example above, the value of multiplier is inserted into a string literal as \(multiplier).
ja: 上の例で、multiplierの値は、文字列リテラルに\(multiplier)として差し込まれます。

source: In the example above, you can see the left-to-right comparison behavior on the first line.
ja: 上の例において、あなたは左から右への比較挙動を最初の行において見ることができます。

source: In the example above, you place the optional chaining question mark after the parentheses, because the optional value you are chaining on is the buildingIdentifier() method’s return value, and not the buildingIdentifier() method itself.
ja: 上の例で、あなたは丸括弧の後にオプショナル連鎖の疑問符を置きます、なぜなら、あなたがその上に連鎖しているオプショナルの値はbuildingIdentifier()メソッドの戻り値であって、buildingIdentifier()メソッドそれ自体ではないからです。

source: In the example above, you write Beverage.allCases to access a collection that contains all of the cases of the Beverage enumeration.
ja: 上の例において、あなたはBeverage.allCasesを書いて、Beverage列挙のケース節の全てを含むコレクションにアクセスします。

source: In the example below, oneAndTwo is an instance of Pair<String>, which conforms to TitledLoggable because String conforms to TitledLoggable.
ja: 下の例において、oneAndTwoはPair<String>のインスタンスです、それはTitledLoggableに準拠します、なぜならStringはTitledLoggableに準拠するからです。

source: In the example below, class A is a public class with a file-private method called someMethod().
ja: 下記の例で、クラスAは公開のクラスです、それはsomeMethod()と呼ばれるあるファイル外非公開のメソッドを持ちます。

source: In the example below, the CompassPoint enumeration has an explicit access level of public.
ja: 以下の例において、CompassPoint列挙は明示的な公開のアクセス水準を持ちます。

source: In the example below, the VendingMachine class has a vend(itemNamed:) method that throws an appropriate VendingMachineError if the requested item is not available, is out of stock, or has a cost that exceeds the current deposited amount:
ja: 下の例において、VendingMachineクラスはvend(itemNamed:)メソッドを持ちます、それは、要求された項目が利用可能でない、在庫切れ、または現在預け入れされた総額を超える価格を持つならば対応するVendingMachineErrorをスローします：

source: In the example below, the constant twoThousand is of type UInt16, whereas the constant one is of type UInt8.
ja: 下記の例で、定数twoThousandは型UInt16ですが、定数oneは型UInt8です。

source: In the example below, the first Bool value (hasDoorKey) is false, but the second value (knowsOverridePassword) is true.
ja: 下記の例で、最初のBool値（hasDoorKey）はfalseです、しかし、第二の値（knowsOverridePassword）はtrueです。

source: In the example below, the values of firstBits and otherBits each have a bit set to 1 in a location that the other does not.
ja: 下記の例で、firstBitsとotherBitsそれぞれの値は、他のものがそうでない場所で、ビットを1に設定されます。

source: In the example below, the values of firstSixBits and lastSixBits both have four middle bits equal to 1.
ja: 下記の例で、firstSixBitsとlastSixBitsの値は、1と等しい４つの中間のビットを両方とも持ちます。

source: In the example below, the values of someBits and moreBits have different bits set to 1.
ja: 下記の例で、someBitsとmoreBitsの値は、1に設定される異なるビットを持ちます。

source: In the example below, when c is not nil, its value is unwrapped and used to evaluate .property, the value of which is used to evaluate .performAction().
ja: 下記の例で、cがnilでないとき、その値はアンラップされて.propertyを評価するために使われ、その値が.performAction()を評価するために使われます。

source: In the examples above, ARC is able to track the number of references to the new Person instance you create and to deallocate that Person instance when it’s no longer needed.
ja: 上の例で、ARCはあなたがつくる新しいPersonインスタンスへの参照の数を追跡して、そのPersonインスタンスをそれがもはや必要でないとき割り当て解除することができます。

source: In the expression 1 + 2, the + symbol is a binary operator and its two operands are the values 1 and 2.
ja: 式1 + 2において、記号+は二項演算子です、そしてその２つの演算数は値1と2です。

source: In the extension, you must implement all of the adopted protocol’s requirements.
ja: 拡張において、あなたは採用されたプロトコルの要件の全てを実装しなければなりません。

source: In the first case, a type identifier refers to a type alias of a named or compound type.
ja: 第一の場合には、型識別子は、名前付きまたは複合の型の型エイリアスに言及します。

source: In the first case, the cluster contains a single scalar; in the second case, it’s a cluster of two scalars:
ja: 最初の場合では、クラスタは、ただ１つだけのスカラーを含みます；２番目の場合には、それは、２つのスカラーのクラスタ（１つの房、群れ）です：

source: In the first example, the expression someTuple is specified to have the tuple type (Double, Double).
ja: 最初の例で、式someTupleは、タプル型(Double, Double)を持つと指定されます。

source: In the first of these two checks, the didSet observer sets currentLevel to a different value.
ja: これらの２つのチェックで最初のものにおいて、didSetオブザーバーは、currentLevelを異なる値に設定します。

source: In the first phase, each stored property is assigned an initial value by the class that introduced it.
ja: 最初の段階では、各格納プロパティは、それを導入したクラスによって、初期値を代入されます。

source: In the following example, for instance, the explicit type annotation (: Float) on the constant eFloat causes the numeric literal 2.71828 to have an inferred type of Float instead of Double.
ja: 例えば、以下の例において、定数eFloatでの明示的な型注釈（: Float）は、数値リテラル2.71828をFloatの推論される型を持つようにします、Doubleではなく。

source: In the implementation of makeOpaqueContainer(item:), the underlying type of the opaque container is [T].
ja: makeOpaqueContainer(item:)の実装において、不透明コンテナの基礎をなす型は、[T]です。

source: In the line of code that says return greeting, the function finishes its execution and returns the current value of greeting.
ja: return greetingを告げるコード行において、関数はその実行を終えてgreetingの現在の値を返します。

source: In the members of a class declaration, Self can appear only as follows:
ja: クラス宣言のメンバーにおいて、Selfは以下のようにのみ現れることができます：

source: In the previous example, it’s not easy to see that someAddress is never evaluated, because accessing a constant doesn’t have any side effects.
ja: 前の例において、someAddressが決して評価されないというのはわかりやすいとはいえません、なぜならある定数を代入することは、何ら副作用を持たないからです。

source: In the scope of a class declaration, writing the static modifier on a member declaration has the same effect as writing the class and final modifiers on that member declaration.
ja: クラス宣言のスコープにおいて、static修飾子をメンバー宣言上で書くことは、class and final修飾子をそのメンバー宣言上で書くことと同じ効果を持ちます。

source: In the second case, a type identifier uses dot (.) syntax to refer to named types declared in other modules or nested within other types.
ja: 第二の場合には、型識別子は、他のモジュールで宣言される、または他の型の内部で入れ子にされる名前付きの型を参照するためにドット（.）構文を使用します。

source: In the second example, the parameter a to the function someFunction is specified to have the type Int.
ja: 第二の例で関数someFunctionのためのパラメータaは、型Intを持つ指定されます。

source: In the setter for perimeter, the new value has the implicit name newValue.
ja: perimeterのためのセッターにおいて、新しい値は、隠された名前newValueを持ちます。

source: In the two examples below, T is inferred to be Int and String respectively:
ja: 下の２つの例で、TはそれぞれIntとStringであると推測されます：

source: In these cases, it’s useful to remove the need to check and unwrap the optional’s value every time it’s accessed, because it can be safely assumed to have a value all of the time.
ja: これらの場合には、オプショナルの値をそれがアクセスされるたびに確認してアンラップする必要を無くすことは役に立ちます、なぜならそれがいつでも値を持つと安全に仮定されることが出来るためです。

source: In these cases, you can omit the value from one side of the range operator.
ja: これらの場合、あなたは範囲演算子の１つの側から値を省くことができます。

source: In this case, Element is used as a placeholder in three places:
ja: この場合、Elementはプレースホルダとして３つの場所で使われます：

source: In this case, T is Int, so the return value is an array of integers and the Item associated type is inferred to be Int.
ja: この場合に、TはIntです、それで戻り値は整数からなるある配列です、そしてItem関連型はIntと推論されます。

source: In this case, because the image is shipped with the application, no error will be thrown at runtime, so it is appropriate to disable error propagation.
ja: この場合、画像はアプリケーションとともに出荷されるので、エラーが実行時にスローされることはありません、それでふさわしいのはエラー伝達を抑制することです。

source: In this case, if the init(name:) initializer of the superclass were ever called with an empty string as the name, the forced unwrapping operation would result in a runtime error.
ja: この場合、スーパークラスのinit(name:)イニシャライザがもしかその名前として空の文字列で呼び出されたならば、強制アンラップ操作は実行時エラーという結果になるでしょう。

source: In this case, it isn’t possible to retrieve a planet with a position of 11, and so the else branch is executed instead.
ja: この場合、11の位置で惑星を取り出すことは可能ではありません、それでelse分岐が代わりに実行されます。

source: In this case, the array literal contains two String values and nothing else.
ja: この場合、配列リテラルは、２つのString値を含んでいて他には何も含みません。

source: In this case, the capture list is [unowned self], which means “capture self as an unowned reference rather than a strong reference”.
ja: この場合、捕獲リストは[unowned self]です、それは、「selfを強い参照ではなく非所有参照として捕獲する」ことを意味します。

source: In this case, the expression is written as \(Double(multiplier) * 2.5) when it’s included inside the string literal.
ja: この場合、式は、それが文字列リテラルに含められる時、\(Double(multiplier) * 2.5)と書かれます。

source: In this case, the loop contains only one statement, which prints an entry from the five-times table for the current value of index.
ja: この場合では、ループは１つの文だけを含みます、それは、indexの現在の値に対する九九の５の段の項を出力します。

source: In this case, the underlying type of the return value varies depending on T: Whatever shape is passed it, repeat(shape:count:) creates and returns an array of that shape.
ja: この場合には、戻り値のその基礎をなす型はTに依存して変動します：どんな形状がそれに渡されても、repeat(shape:count:)はその形状からなるある配列を作成して返します。

source: In this case, there’s no other code inside restoreHealth() that could have an overlapping access to the properties of a Player instance.
ja: この場合には、restoreHealth()内部の他のコードで、Playerインスタンスのプロパティに対するオーバーラップするアクセスを持つことができるものはありません。

source: In this data model, a customer may or may not have a credit card, but a credit card will always be associated with a customer.
ja: このデータ・モデルにおいて、顧客はクレジットカードを持っているかもしれないし、持っていないかもしれません、しかし、クレジットカードは常にひとりの顧客と結び付けられます。

source: In this data model, every country must always have a capital city, and every city must always belong to a country.
ja: このデータ・モデルにおいて、あらゆる国に常に主都がなければなりません、そして、あらゆる都市は常に国に属していなければなりません。

source: In this dictionary, the keys are three-letter International Air Transport Association codes, and the values are airport names:
ja: この辞書では、キーは３文字の国際航空運送協会コードです、そして値は空港名です：

source: In this example, (404, "Not Found") is a tuple that describes an HTTP status code.
ja: この例では、(404, "Not Found")がひとつのタプルです、それはHTTP状態コードを記述します。

source: In this example, firstNumber is a named constant for the value 10, and secondNumber is a named constant for the value 42.
ja: この例では、firstNumberは、値10のための名前をつけられた定数です、そして、secondNumberは値42のための名前をつけられた定数です。

source: In this example, someResolution.width refers to the width property of someResolution, and returns its default initial value of 0.
ja: この例では、someResolution.widthはsomeResolutionのwidthプロパティに言及して、その省略時の初期値の0を返します。

source: In this example, PrettyTextRepresentable adds a single requirement to provide a gettable property called prettyTextualDescription that returns a String.
ja: この例では、PrettyTextRepresentableは１つの要件を加えて、Stringを返すprettyTextualDescriptionと呼ばれる取得可能なプロパティを提供するようにします。

source: In this example, actualNumber is simply used to print the result of the conversion.
ja: この例では、actualNumberは単にその変換の結果を出力するために使われます。

source: In this example, a Double value of 1.0 is considered to represent “one meter”.
ja: この例では、1.0のDouble値は「１メートル」を表すと考慮されます。

source: In this example, a new instance of TimesTable is created to represent the three-times-table.
ja: この例では、TimesTableの新しいインスタンスは、九九の３の段を表すためにつくられます。

source: In this example, code execution continues if age >= 0 evaluates to true, that is, if the value of age is nonnegative.
ja: この例において、コード実行はage >= 0がtrueに評価されるならば、すなわちageの値が負でないならば継続します。

source: In this example, depending on whether you wanted the original total amount or the updated total amount, either $5 or $320 could be the correct answer.
ja: この例では、あなたが望んだのが元の総支出額か更新後の総支出額かにより、5ドルか320ドルのどちらかが正しい答えとなります。

source: In this example, each item in the array might be a Movie, or it might be a Song.
ja: この例では、配列の各項目はMovieであるかもしれませんし、それはSongであるかもしれません。

source: In this example, initialization begins with a call to a convenience initializer on the subclass.
ja: この例では、初期化はサブクラス上での便宜イニシャライザへの呼び出しから始まります。

source: In this example, it checks whether game is actually an instance of SnakesAndLadders behind the scenes, and prints an appropriate message if so.
ja: この例では、gameが実際に舞台裏でSnakesAndLaddersのインスタンスであるかどうか調べて、もしそうならば適切なメッセージを出力します。

source: In this example, it simply prints out the value that is about to be set.
ja: この例では、それは単に設定されようとしている値を出力します。

source: In this example, it would be preferable to write the sorting closure inline, using closure expression syntax.
ja: この例では、クロージャ式構文を使って、ソート・クロージャを行内に書くことがずっと好ましいです。

source: In this example, the Named protocol has a single requirement for a gettable String property called name.
ja: この例において、Namedプロトコルは、取得可能なStringプロパティでnameと呼ばれるものに対するただ１つの要件を持ちます。

source: In this example, the buyFavoriteSnack(person: vendingMachine:) function looks up a given person’s favorite snack and tries to buy it for them by calling the vend(itemNamed:) method.
ja: この例において、buyFavoriteSnack(person: vendingMachine:)関数は指定された個人のお気に入りのスナックを探してそれを彼らのために仕入れることをvend(itemNamed:)メソッドを呼ぶことによって試みます。

source: In this example, the makeASandwich() function will throw an error if no clean dishes are available or if any ingredients are missing.
ja: この例において、makeASandwich()関数は、綺麗な皿が利用可能でないならばまたは何の食材も見つからないならばエラーをスローします。

source: In this example, the attempt to set the address property of john.residence will fail, because john.residence is currently nil.
ja: この例において、john.residenceのaddressプロパティを設定する試みは失敗します、なぜならjohn.residenceが現在nilだからです。

source: In this example, the attempt to set the address property of john.residence will succeed, because the value of john.residence currently contains a valid Residence instance.
ja: この例において、john.residenceのaddressプロパティを設定しようとする試みは成功します、なぜならjohn.residenceの値は現在は有効なResidenceインスタンスを含むからです。

source: In this example, the closing > characters are not treated as a single token that may then be misinterpreted as a bit shift >> operator.
ja: この例において、閉じ>文字たちは、単一のトークンとして見なされることはなく、それでビットシフト演算子>>と誤解されることはありません。

source: In this example, the maximum number of allowed login attempts is declared as a constant, because the maximum value never changes.
ja: この例において、許可されるログインの試みの最大数は、最大の値が決して変わらないので、定数として宣言されます。

source: In this example, the number 5 is correctly identified as a prime number.
ja: この例では、数5は正しく素数と確認されます。

source: In this example, the property wrapper exposes only one piece of information—whether the number was adjusted—so it exposes that Boolean value as its projected value.
ja: この例では、プロパティラッパーは情報の一片だけを露出します — その数が調節されたかどうか — それでそれはそのブール値をそれの予測値として露出します。

source: In this example, the superclass for RecipeIngredient is Food, which has a single convenience initializer called init().
ja: この例では、RecipeIngredientのためのスーパークラスはFoodです、それは、init()と呼ばれる１つの便宜イニシャライザを持ちます。

source: In this example, the value of friendlyWelcome is changed from "Hello!" to "Bonjour!":
ja: この例では、friendlyWelcomeの値は、"Hello!"から"Bonjour!"に変えられます：

source: In this example, the variable number is initialized with the value of the closure’s number parameter, so that the value can be modified within the closure body.
ja: この例では、変数numberはこのクロージャの持つnumberパラメータの値を使って初期化されます、それでその値はクロージャ本体の内部で修正されることができます。

source: In this figure, the left channel has a current level of 9, and the right channel has a current level of 7:
ja: この図には、左のチャンネルに現在9のレベルがあり、右のチャンネルに現在7のレベルがあります：

source: In this form, each case block consists of the case keyword followed by one or more enumeration cases, separated by commas.
ja: この形式では、それぞれのケース節ブロックはキーワードcaseとそれに続く１つ以上の、コンマで区切られた、列挙ケース節から成ります。

source: In this form, each case block consists of the case keyword, followed by one or more enumeration cases, separated by commas.
ja: この形式では、それぞれのケース節ブロックはキーワードcase、それに続けて、コンマで区切られる１つ以上の列挙ケース節から成ります。

source: In this implementation, the input parameters are named left and right to represent the Vector2D instances that will be on the left side and right side of the + operator.
ja: この実装において、入力パラメータは、leftとrightという名前をつけられ、+演算子の左側と右側にあるVector2Dインスタンスを表します。

source: In this protocol, Suffix is an associated type, like the Item type in the Container example above.
ja: このプロトコルにおいて、Suffixは関連型です、上のContainer例でのItem型のように。
